{
    "jesuits-history": "The Jesuits, formally known as the Society of Jesus, are a global religious order of men within the Catholic Church, founded by St. Ignatius of Loyola in 1540. The Society’s members, numbering over 20,000 worldwide, are dedicated to service through education, social justice, and missionary work. In India, over 3,000 Jesuits work in 20 provinces, and in Andhra Pradesh alone, about 200 Jesuits are involved in schools, colleges, youth services, social work centers, parishes, and mission outreach programs. They play a significant role in education, social services, and community building. Their educational institutions focus on imparting knowledge and values that emphasize service to humanity, justice, and social responsibility. Jesuit institutions aim to produce individuals who are not only academically proficient but also deeply committed to the welfare of others, striving to meet the global challenges of today.",
    
    "college-history": "Loyola Polytechnic, formerly known as Sri Y.S Raja Reddy Polytechnic, was established in the year 1980 by Sri Y.S Raja Reddy Educational Trust, Pulivendla, led by Late Dr. Y.S Rajasekhar Reddy, former Chief Minister of Andhra Pradesh as its President. In 1993, the administration of the college was handed over to the Jesuits, who run well-known colleges like Andhra Loyola College, Vijayawada, and Loyola College, Chennai. In 1993, the Government of Andhra Pradesh accorded Minority Status to Loyola (YSRR) Polytechnic, by which 30% seats are reserved for Christian Minority students from A.P., and the rest are admitted by the Government through Polycet. Minority students are admitted based on their merit in the qualifying SSC examination.",
    
    "loyola-history": "St. Ignatius of Loyola, the founder of the Society of Jesus, was born in 1491 as the youngest child of a large Basque family in Spain. The name Loyola comes from the ancestral castle that was the family's heritage. Trained for arms and courtly etiquette, Ignatius enlisted in the border wars with France, where he was badly wounded in battle. During his recovery at Loyola, he read the Gospel narratives and the lives of Saints, which inspired him to abandon worldly ambitions and embrace a life of poverty, sacrifice, and service, following the example of his saintly mentors. He began this new life at the age of 31, spending a year of severe penance and intense prayer in a solitary cave near Manresa, by the river Cardoner. Ignatius recorded his spiritual experiences in a book called 'The Spiritual Exercises,' which became the foundation of Jesuit spirituality. Reflecting on the crisis in the church of his time, he recognized the need for learned and holy priests who were free from greed and ambition and ready to serve the poor, witnessing Christ's love for humanity. To achieve this, he set himself on a path of study, progressing from grammar school to university, ultimately earning his Master's Degree from the Sorbonne in Paris. During this time, he gathered a group of brilliant university men, including St. Francis Xavier, whom he molded through the Spiritual Exercises. Together, they formed the Society of Jesus, or the Jesuits, dedicated to service, education, and the mission of Christ."
  }
  